MatiPl01/stm32-flac-player/Core/Src/main.c
    /** Initialize RTC and set the Time and Date
    */
    sTime.Hours = 0x0;
    sTime.Minutes = 0x0;
    sTime.Seconds = 0x0;
    sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
    sTime.StoreOperation = RTC_STOREOPERATION_RESET;
    if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK) {
        Error_Handler();
    }
    sDate.WeekDay = RTC_WEEKDAY_MONDAY;
    sDate.Month = RTC_MONTH_JANUARY;
    sDate.Date = 0x1;
    sDate.Year = 0x0;
    if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK) {
        Error_Handler();
    }
    /** Enable the Alarm A
    */
    sAlarm.AlarmTime.Hours = 0x0;
    sAlarm.AlarmTime.Minutes = 0x0;
    sAlarm.AlarmTime.Seconds = 0x0;
    sAlarm.AlarmTime.SubSeconds = 0x0;
    sAlarm.AlarmTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
    sAlarm.AlarmTime.StoreOperation = RTC_STOREOPERATION_RESET;
    sAlarm.AlarmMask = RTC_ALARMMASK_NONE;
    sAlarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
    sAlarm.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_DATE;
    sAlarm.AlarmDateWeekDay = 0x1;
    sAlarm.Alarm = RTC_ALARM_A;
    if (HAL_RTC_SetAlarm(&hrtc, &sAlarm, RTC_FORMAT_BCD) != HAL_OK) {
        Error_Handler();
    }
    /** Enable the Alarm B
    */
    sAlarm.Alarm = RTC_ALARM_B;
    if (HAL_RTC_SetAlarm(&hrtc, &sAlarm, RTC_FORMAT_BCD) != HAL_OK) {
        Error_Handler();
    }
    /** Enable the TimeStamp
    */
    if (HAL_RTCEx_SetTimeStamp(&hrtc, RTC_TIMESTAMPEDGE_RISING, RTC_TIMESTAMPPIN_POS1) != HAL_OK) {
        Error_Handler();
    }
}

/**
  * @brief SAI2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SAI2_Init(void) {
    hsai_BlockA2.Instance = SAI2_Block_A;
    hsai_BlockA2.Init.Protocol = SAI_FREE_PROTOCOL;
    hsai_BlockA2.Init.AudioMode = SAI_MODEMASTER_TX;
    hsai_BlockA2.Init.DataSize = SAI_DATASIZE_8;
    hsai_BlockA2.Init.FirstBit = SAI_FIRSTBIT_MSB;
    hsai_BlockA2.Init.ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;
    hsai_BlockA2.Init.Synchro = SAI_ASYNCHRONOUS;
    hsai_BlockA2.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
    hsai_BlockA2.Init.NoDivider = SAI_MASTERDIVIDER_ENABLE;
    hsai_BlockA2.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_EMPTY;
    hsai_BlockA2.Init.AudioFrequency = SAI_AUDIO_FREQUENCY_192K;
    hsai_BlockA2.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
    hsai_BlockA2.Init.MonoStereoMode = SAI_STEREOMODE;
    hsai_BlockA2.Init.CompandingMode = SAI_NOCOMPANDING;
    hsai_BlockA2.Init.TriState = SAI_OUTPUT_NOTRELEASED;
    hsai_BlockA2.FrameInit.FrameLength = 8;
    hsai_BlockA2.FrameInit.ActiveFrameLength = 1;
    hsai_BlockA2.FrameInit.FSDefinition = SAI_FS_STARTFRAME;
    hsai_BlockA2.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
    hsai_BlockA2.FrameInit.FSOffset = SAI_FS_FIRSTBIT;
    hsai_BlockA2.SlotInit.FirstBitOffset = 0;
    hsai_BlockA2.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
    hsai_BlockA2.SlotInit.SlotNumber = 1;
    hsai_BlockA2.SlotInit.SlotActive = 0x00000000;
    if (HAL_SAI_Init(&hsai_BlockA2) != HAL_OK) {
        Error_Handler();
    }
    hsai_BlockB2.Instance = SAI2_Block_B;
    hsai_BlockB2.Init.Protocol = SAI_FREE_PROTOCOL;
    hsai_BlockB2.Init.AudioMode = SAI_MODESLAVE_RX;
    hsai_BlockB2.Init.DataSize = SAI_DATASIZE_8;
    hsai_BlockB2.Init.FirstBit = SAI_FIRSTBIT_MSB;
    hsai_BlockB2.Init.ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;
    hsai_BlockB2.Init.Synchro = SAI_SYNCHRONOUS;
    hsai_BlockB2.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
    hsai_BlockB2.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_EMPTY;
    hsai_BlockB2.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
    hsai_BlockB2.Init.MonoStereoMode = SAI_STEREOMODE;
    hsai_BlockB2.Init.CompandingMode = SAI_NOCOMPANDING;
    hsai_BlockB2.Init.TriState = SAI_OUTPUT_NOTRELEASED;
    hsai_BlockB2.FrameInit.FrameLength = 8;
    hsai_BlockB2.FrameInit.ActiveFrameLength = 1;
    hsai_BlockB2.FrameInit.FSDefinition = SAI_FS_STARTFRAME;
    hsai_BlockB2.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
    hsai_BlockB2.FrameInit.FSOffset = SAI_FS_FIRSTBIT;
    hsai_BlockB2.SlotInit.FirstBitOffset = 0;
    hsai_BlockB2.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
    hsai_BlockB2.SlotInit.SlotNumber = 1;
    hsai_BlockB2.SlotInit.SlotActive = 0x00000000;
    if (HAL_SAI_Init(&hsai_BlockB2) != HAL_OK) {
        Error_Handler();
    }
}

/**
  * @brief SDMMC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SDMMC1_SD_Init(void) {
    hsd1.Instance = SDMMC1;
    hsd1.Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING;
    hsd1.Init.ClockBypass = SDMMC_CLOCK_BYPASS_DISABLE;
    hsd1.Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    hsd1.Init.BusWide = SDMMC_BUS_WIDE_1B;
    hsd1.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    hsd1.Init.ClockDiv = 0;
}

/**
  * @brief SPDIFRX Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPDIFRX_Init(void) {
    hspdif.Instance = SPDIFRX;
    hspdif.Init.InputSelection = SPDIFRX_INPUT_IN0;
    hspdif.Init.Retries = SPDIFRX_MAXRETRIES_NONE;
    hspdif.Init.WaitForActivity = SPDIFRX_WAITFORACTIVITY_OFF;
    hspdif.Init.ChannelSelection = SPDIFRX_CHANNEL_A;
    hspdif.Init.DataFormat = SPDIFRX_DATAFORMAT_LSB;
    hspdif.Init.StereoMode = SPDIFRX_STEREOMODE_DISABLE;
    hspdif.Init.PreambleTypeMask = SPDIFRX_PREAMBLETYPEMASK_OFF;
    hspdif.Init.ChannelStatusMask = SPDIFRX_CHANNELSTATUS_OFF;
    hspdif.Init.ValidityBitMask = SPDIFRX_VALIDITYMASK_OFF;
    hspdif.Init.ParityErrorMask = SPDIFRX_PARITYERRORMASK_OFF;
    if (HAL_SPDIFRX_Init(&hspdif) != HAL_OK) {
        Error_Handler();
    }
}

/**
  * @brief SPI2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI2_Init(void) {
    /* SPI2 parameter configuration*/
    hspi2.Instance = SPI2;
    hspi2.Init.Mode = SPI_MODE_MASTER;
    hspi2.Init.Direction = SPI_DIRECTION_2LINES;
    hspi2.Init.DataSize = SPI_DATASIZE_4BIT;
    hspi2.Init.CLKPolarity = SPI_POLARITY_LOW;
    hspi2.Init.CLKPhase = SPI_PHASE_1EDGE;
    hspi2.Init.NSS = SPI_NSS_SOFT;
    hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
    hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
    hspi2.Init.TIMode = SPI_TIMODE_DISABLE;
    hspi2.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    hspi2.Init.CRCPolynomial = 7;
    hspi2.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
    hspi2.Init.NSSPMode = SPI_NSS_PULSE_ENABLE;
    if (HAL_SPI_Init(&hspi2) != HAL_OK) {
        Error_Handler();
    }
}

/**
  * @brief TIM1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM1_Init(void) {
    TIM_ClockConfigTypeDef sClockSourceConfig = {0};
    TIM_MasterConfigTypeDef sMasterConfig = {0};
    TIM_OC_InitTypeDef sConfigOC = {0};
    TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig = {0};

    htim1.Instance = TIM1;
    htim1.Init.Prescaler = 0;
    htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim1.Init.Period = 65535;
    htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim1.Init.RepetitionCounter = 0;
    htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_Base_Init(&htim1) != HAL_OK) {
        Error_Handler();
    }
    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_TIM_PWM_Init(&htim1) != HAL_OK) {
        Error_Handler();
    }
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK) {
        Error_Handler();
    }
    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = 0;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
    sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1) != HAL_OK) {
        Error_Handler();
    }
    sBreakDeadTimeConfig.OffStateRunMode = TIM_OSSR_DISABLE;
    sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_DISABLE;
    sBreakDeadTimeConfig.LockLevel = TIM_LOCKLEVEL_OFF;
    sBreakDeadTimeConfig.DeadTime = 0;
    sBreakDeadTimeConfig.BreakState = TIM_BREAK_DISABLE;
    sBreakDeadTimeConfig.BreakPolarity = TIM_BREAKPOLARITY_HIGH;
    sBreakDeadTimeConfig.BreakFilter = 0;
    sBreakDeadTimeConfig.Break2State = TIM_BREAK2_DISABLE;
    sBreakDeadTimeConfig.Break2Polarity = TIM_BREAK2POLARITY_HIGH;
    sBreakDeadTimeConfig.Break2Filter = 0;
    sBreakDeadTimeConfig.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
    if (HAL_TIMEx_ConfigBreakDeadTime(&htim1, &sBreakDeadTimeConfig) != HAL_OK) {
        Error_Handler();
    }

    HAL_TIM_MspPostInit(&htim1);
}

/**
  * @brief TIM2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM2_Init(void) {
    TIM_ClockConfigTypeDef sClockSourceConfig = {0};
    TIM_MasterConfigTypeDef sMasterConfig = {0};
    TIM_OC_InitTypeDef sConfigOC = {0};

