MatiPl01/stm32-flac-player/Core/Src/main.c
static void http_server_netconn_thread(void const *arg)
{
  struct netconn *conn, *newconn;
  err_t err, accept_err;

  xprintf("http_server_netconn_thread\n");

  /* Create a new TCP connection handle */
  conn = netconn_new(NETCONN_TCP);

  if (conn!= NULL)
  {
    /* Bind to port 80 (HTTP) with default IP address */
    err = netconn_bind(conn, NULL, 80);

    if (err == ERR_OK)
    {
      /* Put the connection into LISTEN state */
      netconn_listen(conn);

      while(1)
      {
        /* accept any icoming connection */
        accept_err = netconn_accept(conn, &newconn);
        if(accept_err == ERR_OK)
        {
          /* serve connection */
          http_server_serve(newconn);

          /* delete connection */
          netconn_delete(newconn);
        }
      }
    }
  }
}
#endif

int GetPlaylistItemName(int item, char *itemName) {
    if (strlen(&fileListBuf[item][0]) == 0) {
        xprintf("GetPlaylistItemName: playlist probably empty\n");
        return -1;
    }

    if (item >= playListLen) {
        item = 0;
        xprintf("GetPlaylistItemName: rollover to start, item=%d\n", item);
        return 1;
    }
    if (item >= playListLen) {
        item = playListLen - 1;
        xprintf("GetPlaylistItemName: rollover to end, item=%d\n", item);
        return 2;
    }

    strcpy(itemName, &fileListBuf[item][0]);
    return 0;
}


int SetPlaylistItemName(int item, char *itemName) {
    xprintf("SetPlaylistItemName, item=%d, name: %s\n", item, itemName);
#warning "add item to the playlist"
    return 0;
}


void playerStartPlayback(char *fileName) {
    FRESULT res;
    xprintf("playerStartPlayback, file: %s\n", fileName);
    //res = f_open(&file,"0:/testwave.wav",FA_READ);
    res = f_open(&file, fileName, FA_READ);
    if (res == FR_OK) {
        xprintf("wave file open OK\n");
    } else {
        xprintf("wave file open ERROR, res = %d\n", res);
    }
    player_state = 1;
    BSP_AUDIO_OUT_Play((uint16_t *) &buff[0], AUDIO_OUT_BUFFER_SIZE);
    fpos = 0;
    buf_offs = BUFFER_OFFSET_NONE;
}

void playerResumePlayback(void) {
    uint8_t res = BSP_AUDIO_OUT_Resume();
    if (res == AUDIO_OK) {
        player_state = PLAYER_STATE_PLAYING;
        xprintf("player resumed\n");
    } else {
        xprintf("player error @ resume\n");
    }
}

void playerPause(void) {
    uint8_t res = BSP_AUDIO_OUT_Pause();
    if (res == AUDIO_OK) {
        player_state = PLAYER_STATE_PAUSED;
        xprintf("player paused\n");
    } else {
        xprintf("player error @ pause\n");
    }
}

void playerStop(void) {
    BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
    f_close(&file);
    fpos = 0;
    buf_offs = BUFFER_OFFSET_NONE;
    if (player_state != PLAYER_STATE_EOF) {
        player_state = PLAYER_STATE_STOPPED;
    }
    memset(buff, 0, AUDIO_OUT_BUFFER_SIZE);
}


int ListFilesInCurrentDir(char *path, int maxEntries, int nameLen) {
    xprintf("ListFilesInDir\n");
#warning "create a playlist"
    return 0;
}


void StartPlaylistPlayback(void) {
    xprintf("StartPlaylistPlayback...\n");
    playListLen =
            ListFilesInCurrentDir("", FILE_LIST_MAX_LEN, FILE_NAME_LEN);
    xprintf("ListFilesInCurrentDir returned: %d\n", playListLen);
    currentItemToPlay = 0;
}


int PlayNextItem(void) {
    playerStop();
    if (currentItemToPlay < (playListLen - 1)) {
        currentItemToPlay++;
    } else {
        currentItemToPlay = 0;
    }
    xprintf("next - new item=%d, playlist len=%d\n", currentItemToPlay, playListLen);
    int res =
            GetPlaylistItemName(currentItemToPlay, fileNamePlaying);
    playerStartPlayback(fileNamePlaying);
    if (res) return -1; else return 0;
}

int PlayPreviousItem(void) {
    playerStop();
    if (currentItemToPlay > 0) {
        currentItemToPlay--;
    } else {
        currentItemToPlay = playListLen - 1;
    }
    xprintf("previous - new item=%d, playlist len=%d\n", currentItemToPlay, playListLen);
    int res =
            GetPlaylistItemName(currentItemToPlay, fileNamePlaying);
    playerStartPlayback(fileNamePlaying);
    if (res) return -1; else return 0;
}

void RedrawList(void);

int serialTestComm(char key) {
    const int CURSOR_MOVE_STEP = 10;
    switch (key) {
        case 0:
            break;

        case '?': {
            RedrawList();
            break;
        }

        case 'l': {
            playListLen =
                    ListFilesInCurrentDir("", FILE_LIST_MAX_LEN, FILE_NAME_LEN);
            xprintf("ListFilesInCurrentDir returned: %d\n", playListLen);
            currentItemToPlay = 0;
            //intentionally no break
            //break;
        }

        case 'D': {
            xprintf("Playlist, len = %d , current item = %d\n", playListLen, currentItemToPlay);
            for (int i = 0; i < playListLen; i++) {
                xprintf("item %d: %s\n", i, &fileListBuf[i][0]);
            }
            break;
        }

        case 'c': {
            switch (player_state) {
                case PLAYER_STATE_PAUSED:
                    xprintf("player had been baused - resuming\n");
                    playerResumePlayback();
                    break;
                case PLAYER_STATE_PLAYING:
                    xprintf("player will be paused\n");
                    playerPause();
                    break;
                default:
                    break;
            }

            break;
        }

        case 'x': {
            xprintf("play command...\n");
            switch (player_state) {
                case PLAYER_STATE_PAUSED: {
                    xprintf("player had been paused - resuming\n");
                    playerResumePlayback();
                    RedrawList();
                    break;
                }
                case PLAYER_STATE_PLAYING: {
                    xprintf("already playing, restart...\n");
                    playerStop();
                    RedrawList();
                }
                case PLAYER_STATE_STOPPED:
                case PLAYER_STATE_EOF: {
                    int res =
                            GetPlaylistItemName(currentItemToPlay, fileNamePlaying);
                    if (res < 0) {
                        StartPlaylistPlayback();
                        GetPlaylistItemName(currentItemToPlay, fileNamePlaying);
                    }
                    playerStartPlayback(fileNamePlaying);
                    RedrawList();
                    break;
                }

