MatiPl01/stm32-flac-player/Core/Src/main.c
            }
            break;
        }

        case 'z': {
            PlayPreviousItem();
            RedrawList();
            break;
        }

        case 'b': {
            PlayNextItem();
            RedrawList();
            break;
        }

        case 'v': {
            xprintf("stop command\n");
            switch (player_state) {
                case PLAYER_STATE_PAUSED:
                    xprintf("the player had been paused\n");
                    playerResumePlayback();
                case PLAYER_STATE_PLAYING:
                    xprintf("player stop\n");
                    playerStop();
                    RedrawList();
                    break;
                default:
                    //no effect
                    RedrawList();
                    break;
            }
            break;
        }

        default: {
            xprintf("not supported command: %c\n", key);
            break;
        }
    }
    return 0;
}


void handlePlayer(void) {
    switch (player_state) {
        case PLAYER_STATE_STOPPED:
        case PLAYER_STATE_PAUSED:
        case PLAYER_STATE_EOF: {
            break;
        }

        case PLAYER_STATE_PLAYING: {
            uint32_t br;

            if (buf_offs == BUFFER_OFFSET_HALF) {
                if (f_read(&file,
                           &buff[0],
                           AUDIO_OUT_BUFFER_SIZE / 2,
                           (void *) &br) != FR_OK) {
                    BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
                    xprintf("f_read error on half\n");
                }
                buf_offs = BUFFER_OFFSET_NONE;
                fpos += br;
            }

            if (buf_offs == BUFFER_OFFSET_FULL) {
                if (f_read(&file,
                           &buff[AUDIO_OUT_BUFFER_SIZE / 2],
                           AUDIO_OUT_BUFFER_SIZE / 2,
                           (void *) &br) != FR_OK) {
                    BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
                    xprintf("f_read error on full\n");
                }

                buf_offs = BUFFER_OFFSET_NONE;
                fpos += br;
            }

            if ((br < AUDIO_OUT_BUFFER_SIZE / 2) && fpos) {
                xprintf("stop at eof\n");
                player_state = PLAYER_STATE_EOF;
                playerStop();
                PlayNextItem();
            }
        }
    }
}

void RedrawList(void) {
    const int PLAYLIST_DISP_LINES = 10;

    xprintf("redraw...\n");
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);

    int itemToDisp = 0;

    for (int line = 0; line < PLAYLIST_DISP_LINES; line++) {
        BSP_LCD_ClearStringLine(line);
        if (itemToDisp < playListLen) {
            if (itemToDisp == currentItemToPlay) BSP_LCD_SetBackColor(LCD_COLOR_GRAY);
            BSP_LCD_DisplayStringAtLine(line, (uint8_t *) &fileListBuf[itemToDisp][0]);
            BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
            itemToDisp++;
        } else {
            //xprintf("- -\n");
        }
    }
}

/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
void StartDefaultTask(void const *argument) {
    /* init code for LWIP */
    MX_LWIP_Init();

    /* init code for USB_HOST */
    MX_USB_HOST_Init();
    /* USER CODE BEGIN 5 */

    controller_task();

//    controller_task();

//    draw_background();
//
//    uint8_t status = BSP_TS_Init(DISPLAY_WIDTH, DISPLAY_HEIGHT);
//    if (status != TS_OK)
//        xprintf("TS init error\n");
//
//    xprintf("initializing audio codec...\n");
//    if (BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_HEADPHONE1, 60, AUDIO_FREQUENCY_44K) == 0) {
//        xprintf("audio init OK\n");
//    } else {
//        xprintf("audio init ERROR\n");
//    }
//    BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
//
//    static ApplicationTypeDef previousAppli_state;
//
//    /* Infinite loop */
//    for (;;) {
//        HAL_IWDG_Refresh(&hiwdg);
//        vTaskDelay(5);
//        LD1_TOGGLE; /* Just blink to say "I'm alive" */
//
//        //a recommended line to read the touch screen :)
//        TS_StateTypeDef TS_State;
//        BSP_TS_GetState(&TS_State);
//
//        char key = debug_inkey();
//        serialTestComm(key);
//
//        handlePlayer();
//
//        if (previousAppli_state != Appli_state) {
//
//            if (Appli_state == APPLICATION_READY) {
//                HID_TypeTypeDef hiddev = USBH_HID_GetDeviceType(&hUsbHostFS);
//                xprintf("Appli_state is now APPLICATION_READY, detected device: ");
//                switch (hiddev) {
//                    case HID_MOUSE: {
//                        xprintf("mouse\n");
//                        USBH_HID_MouseInit(&hUsbHostFS);
//                        break;
//                    }
//                    case HID_KEYBOARD: {
//                        xprintf("keyboard\n");
//                        USBH_HID_KeybdInit(&hUsbHostFS);
//                        break;
//                    }
//                    case HID_UNKNOWN: {
//                        xprintf("unknown or not supported by the firmware driver.\n");
//                        vTaskDelay(1000);
//                        xprintf("Hey, it's just firmware - not Linux :P\n");
//                        break;
//                    }
//                }
//            }
//
//            previousAppli_state = Appli_state;
//        }
//    }
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance == TIM6) {
        HAL_IncTick();
    }
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void) {
    /* User can add his own implementation to report the HAL error return state */
    __disable_irq();
    while (1) {
    }
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
